cases/chpt2-damBreak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          162;
        startFace       42318;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          162;
        startFace       42480;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          156;
        startFace       42642;
    }
    atmosphere
    {
        type            patch;
        nFaces          132;
        startFace       42798;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          42624;
        startFace       42930;
    }
)

// ************************************************************************* //
